{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 48, 48, 3]}}, {"class_name": "Conv2D", "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d", "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_1", "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_2", "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add", "inbound_nodes": [[["activation", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add"}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["add", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_2", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_3", "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_4", "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["activation_2", 0, 0, {}], ["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_1"}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_4", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_5", "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_5", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_5", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_6", "filters": 16, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_6", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["activation_4", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_2"}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_6", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_7", "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_7", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_7", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_8", "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_9", "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_8", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_3"}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_8", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_10", "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_9", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_9", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_11", "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_10", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["activation_8", 0, 0, {}], ["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_4"}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_10", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_12", "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_11", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_11", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_13", "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_12", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["activation_10", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_5"}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_12", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_14", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_13", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_13", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_15", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [1, 1], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_16", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_14", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_6"}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_14", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_17", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_15", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_15", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_18", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_16", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["activation_14", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_7"}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_16", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_19", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_17", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_17", "activation": "relu"}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"trainable": true, "padding": "same", "kernel_size": [3, 3], "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "name": "conv2d_20", "filters": 64, "data_format": "channels_last", "bias_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_18", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "beta_constraint": null, "dtype": "float32", "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null}}, {"class_name": "Add", "name": "add_8", "inbound_nodes": [[["activation_16", 0, 0, {}], ["batch_normalization_18", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add_8"}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation_18", "activation": "relu"}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"trainable": true, "padding": "valid", "name": "average_pooling2d", "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Flatten", "name": "flatten", "inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense", "units": 2, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal"}}, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax"}}], "name": "model", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}